{
  "char2idx": {
    "[PAD]": 0,
    "[UNK]": 1,
    "[CLS]": 2,
    "[SEP]": 3,
    "[MASK]": 4,
    " ": 5,
    "!": 6,
    "\"": 7,
    "#": 8,
    "$": 9,
    "&": 10,
    "'": 11,
    "(": 12,
    ")": 13,
    "*": 14,
    "+": 15,
    ",": 16,
    "-": 17,
    ".": 18,
    "/": 19,
    "0": 20,
    "1": 21,
    "2": 22,
    "3": 23,
    "4": 24,
    "5": 25,
    "6": 26,
    "7": 27,
    "8": 28,
    "9": 29,
    ":": 30,
    ";": 31,
    "<": 32,
    "=": 33,
    ">": 34,
    "?": 35,
    "@": 36,
    "A": 37,
    "B": 38,
    "C": 39,
    "D": 40,
    "E": 41,
    "F": 42,
    "G": 43,
    "H": 44,
    "I": 45,
    "J": 46,
    "K": 47,
    "L": 48,
    "M": 49,
    "N": 50,
    "O": 51,
    "P": 52,
    "Q": 53,
    "R": 54,
    "S": 55,
    "T": 56,
    "U": 57,
    "V": 58,
    "W": 59,
    "X": 60,
    "Y": 61,
    "Z": 62,
    "[": 63,
    "\\": 64,
    "]": 65,
    "^": 66,
    "_": 67,
    "a": 68,
    "b": 69,
    "c": 70,
    "d": 71,
    "e": 72,
    "f": 73,
    "g": 74,
    "h": 75,
    "i": 76,
    "j": 77,
    "k": 78,
    "l": 79,
    "m": 80,
    "n": 81,
    "o": 82,
    "p": 83,
    "q": 84,
    "r": 85,
    "s": 86,
    "t": 87,
    "u": 88,
    "v": 89,
    "w": 90,
    "x": 91,
    "y": 92,
    "z": 93,
    "{": 94,
    "|": 95,
    "}": 96,
    "~": 97
  },
  "char_freq": {
    "A": 2773205,
    "3": 716683,
    " ": 14189206,
    "B": 2553267,
    "D": 934338,
    "F": 1212887,
    "|": 3990587,
    "E": 956673,
    "G": 1997121,
    ",": 250436,
    "2": 2938490,
    "d": 2640325,
    ":": 523581,
    "f": 1571735,
    "a": 833393,
    "b": 292192,
    "e": 2063799,
    "z": 159953,
    "g": 1311271,
    "c": 2075262,
    "/": 1231467,
    "^": 254215,
    ">": 660780,
    "(": 611072,
    "{": 123308,
    "}": 123293,
    "4": 304812,
    ")": 443168,
    "]": 243890,
    "\"": 1643763,
    "C": 280564,
    "#": 15741,
    "-": 80632,
    "7": 142113,
    "m": 159658,
    "?": 544,
    "1": 79657,
    "!": 70950,
    "r": 35591,
    "t": 35597,
    "_": 35830,
    ".": 124624,
    "v": 11644,
    "=": 87849,
    "x": 1580,
    "8": 20556,
    "~": 413,
    "'": 73806,
    "T": 35970,
    "s": 16028,
    "n": 17698,
    "o": 18832,
    "i": 26117,
    "S": 9635,
    "<": 105070,
    "W": 692,
    "l": 15109,
    "[": 177166,
    "M": 27314,
    "6": 55467,
    "N": 2171,
    "w": 4436,
    "K": 20397,
    "O": 5944,
    "P": 4256,
    "u": 19000,
    "k": 1939,
    "p": 7741,
    "Q": 3008,
    "0": 3943,
    "V": 1658,
    "R": 939,
    "h": 5484,
    "y": 3142,
    "5": 5052,
    "9": 3226,
    "\\": 1077,
    "+": 1175,
    "*": 2494,
    "U": 309,
    "q": 435,
    "L": 675,
    "X": 107,
    "Y": 30,
    "H": 431,
    "I": 1429,
    "J": 314,
    "&": 139,
    "$": 337,
    "j": 632,
    "@": 31,
    "Z": 37,
    ";": 154,
    "`": 4
  }
}